In [2]:
import pandas as pd
df =  pd.read_csv('./pandas.csv', encoding='CP949')
df.info()
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   번호      7 non-null      int64
 1   성명      7 non-null      object
 2   나이      7 non-null      int64
 3   몸무게     6 non-null      float64
 4   급여      6 non-null      float64
dtypes: float64(2), int64(2), object(1)
memory usage: 408.0+ bytes

    번호   성명  나이    몸무게         급여
0  100  김민재  27   75.0  5428000.0
1  101  이강인  22   57.0        NaN
2  102  박찬호  50   91.0  8428000.0
3  103  차범근  70    NaN  4428000.0
4  104  추신수  43  100.0  4528000.0
5  105  손흥민  31   72.0  7028000.0
6  106  황희찬  28   69.0  2528000.0

In [3]:
df.columns

Index(['번호', '성명', '나이', '몸무게', '급여'], dtype='object')

In [4]:
df['몸무게'] = df['몸무게'].astype('Int64')
df.info()     # 각 컬럼의 데이터 형식을 확인할 수 있다.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   번호      7 non-null      int64
 1   성명      7 non-null      object
 2   나이      7 non-null      int64
 3   몸무게     6 non-null      Int64
 4   급여      6 non-null      float64
dtypes: Int64(1), float64(1), int64(2), object(1)
memory usage: 415.0+ bytes

In [5]:
df.loc[0:3, ['성명','급여']]

    성명         급여
0  김민재  5428000.0
1  이강인        NaN
2  박찬호  8428000.0
3  차범근  4428000.0

In [6]:
df[df['급여']>=5000000]

    번호   성명  나이  몸무게         급여
0  100  김민재  27   75  5428000.0
2  102  박찬호  50   91  8428000.0
5  105  손흥민  31   72  7028000.0

In [ ]:
df.loc[df['급여']>=5000000, ['번호','성명','급여']] # 특정 조건을 만족하는 행에서 여러 컬럼을 선택할 수 있다.

df.loc[df['급여']>=5000000, '번호':'급여'] # 슬라이싱을 사용하여 특정 범위의 컬럼을 선택할 수 있다.

    번호   성명  나이  몸무게         급여
0  100  김민재  27   75  5428000.0
2  102  박찬호  50   91  8428000.0
5  105  손흥민  31   72  7028000.0

In [ ]:
# '나이' 컬럼을 기준으로 데이터를 정렬한다.
df.sort_values(by='나이', ascending=False) # '몸무게' 컬럼을 기준으로 데이터를 내림차순으로 정렬한다.
df.sort_values(['몸무게', '나이'], ascending=False)     # 여러 컬럼을 기준으로 정렬할 수도 있다.

    번호   성명  나이   몸무게         급여
4  104  추신수  43   100  4528000.0
2  102  박찬호  50    91  8428000.0
0  100  김민재  27    75  5428000.0
5  105  손흥민  31    72  7028000.0
6  106  황희찬  28    69  2528000.0
1  101  이강인  22    57        NaN
3  103  차범근  70  <NA>  4428000.0

# 데이터 결측치

In [9]:
df.isna()     # 결측치가 존재하는 곳에 True를 표시한다.
df.isnull()   # .isna() 메서드와 같이 결측치가 존재하는곳에 True를 표시한다.

      번호     성명     나이    몸무게     급여
0  False  False  False  False  False
1  False  False  False  False   True
2  False  False  False  False  False
3  False  False  False   True  False
4  False  False  False  False  False
5  False  False  False  False  False
6  False  False  False  False  False

In [20]:
df.isna().sum()   # 전체 데이터에서 각 컬럼마다 존재하는 결측치를 더한 결과를 표시한다

번호     0
성명     0
나이     0
몸무게    1
급여     1
dtype: int64

결측치(NaN)가 포함된 행(row) 전체를 삭제한 다음, df 에 삭제된 결과를 저장

In [21]:
import pandas as pd
df =  pd.read_csv('./pandas.csv', encoding='CP949')

# 방법 1: 결과를 다시 변수에 저장
df = df.dropna()

# 방법 2: 원본 DataFrame에 직접 적용
df.dropna(inplace=True)

df

    번호   성명  나이    몸무게         급여
0  100  김민재  27   75.0  5428000.0
2  102  박찬호  50   91.0  8428000.0
4  104  추신수  43  100.0  4528000.0
5  105  손흥민  31   72.0  7028000.0
6  106  황희찬  28   69.0  2528000.0